let handler = async (m, { conn }) => {
m.reply(global.terminos)}
handler.customPrefix = /términos y condiciones y privacidad|terminosycondicionesyprivacidad|terminosycondiciones|privacidad|الاستخدام|الخصوصيه|الخصوصية|الخصوصيه ولا الاستخدام|شروط الخصوصية|شروط الخصوصيه|شروط الاستخدام/i
handler.command = new RegExp
export default handler

global.terminos = `
*❈↲ الجهل بما هو مذكور هنا يعفي مالك البوت أو البوت الفرعي أو مستخدم البوت من العقوبات التي قد تنشأ عن ذلك❗*

----------------
*⚠️ شروط الخصوصية*:

1. البوت بيسجل الرسائل عشان يرد عليها بطريقة ذكية ومسلية، بس مش هيعرض محتويات الرسائل لأي حد تاني.

2. لما تستخدم البوت، فهم إنه ممكن يسجل بيانات زي اسمك ومعلومات اللعبة علشان يقدم لك خدماته بشكل أفضل.

3. البوت مصمم عشان يكون تجربة مرحة وآمنة في المجموعات، وبيحافظ على خصوصيتك ومعلوماتك الشخصية بأمان تام.
----------------
*شروط استخدام بوت التربو*

*أهلاً وسهلاً بيك في عالمي الخاص البوت للمرح واللي هيخلي الواتساب بتاعك في عالم تاني! عشان نضمن إنك تستمتع بأفضل تجربة، لازم نوضح شوية شروط بسيطة وسهلة:*

1. *نستخدمه بأدب وذوق:* البوت هنا عشان يرد على رسائلك، يحمي مجموعتك، يصنع ملصقات، ويشغل ألعاب. يبقى من فضلك نتعامل معاه بأدب وما نستخدموش في حاجة مش لائقة.

2. *البوت مش سوبرمان:* البوت شاطر وذكي، بس برضو عنده حدود. مش هنقدر نرد على كل حاجة في نفس اللحظة. ادينا فرصة واحنا هنبذل قصارى جهدنا عشان نساعدك.

3. *ألعاب ومسابقات في حدود العقل*: البوت عنده ألعاب حلوة ومسابقات ممتعة. لو سمحت، نلعب بعقل وما نستخدمش الألعاب بطريقة ممكن تأذي حد أو تخرب علينا.

4. *الخصوصية حاجة مهمة*: البوت هنا عشان يساعد، مش عشان يتجسس عليك. معلوماتك كلها في أمان ومش هنتشاركها مع حد من غير إذنك.

5. *المجموعات ليها قوانين*: لو البوت بيحمي المجموعة، يبقى الكل لازم يلتزم بالقوانين اللي متفق عليها في المجموعة. البوت هيشوف الرسائل اللي مش مناسبة ويشيلها، بس برضو لازم نحترم بعض.

6. *الملصقات والفن*: البوت بيعرف يصنع ملصقات تحفة. بس من فضلك، نستخدم صور محترمة وملهاش حقوق ملكية محفوظة، عشان ما نسببش مشاكل.

7. *الصيانة والتحديثات*: البوت زي أي حاجة تانية، محتاج صيانة وتحديثات عشان يفضل شغال تمام. لو فيه أي مشكلة، اتواصل معانا وإحنا هنحلها في أسرع وقت.

8. *استمتع*: وأهم حاجة، إنك تستمتع وتبسط مع البوت المرح بتاعك! خلي تجربتك معاه مليانة ضحك ومرح.

لو عندك أي استفسار أو مشكلة، احنا هنا عشان نساعدك. شكراً لاستخدامك بوت التربو

----------------

❈↲ *⁉️ لو عندك شك علي اي حاجه كلم المطور*
❈↲ لو عندك اي اسئلة او شك من حاجه معينه كلم المطور وان شاء الله هيرد في اقرب وقت ممكن_ 
❈↲روابط المطور
 رقم الطور الاساسي :
❈↲ https://wa.me/+201225655220

-----------------

 *〘B O T╎👑╎E L T A R B O O〙*`
