import util from 'util'
import path from 'path'
let user = a => '@' + a.split('@')[0]
function handler(m, { groupMetadata, command, conn, text, usedPrefix }) {
  if (!text) throw `*أدخــل الـسـؤال !*`
  let ps = groupMetadata.participants.map(v => v.id)
  let a = ps.getRandom()
  let responses = [
    'احــتـمـال قـلـيـل',
    'نــعم بـالـتـأكـيد',
    'لا أعـتـقـد',
    'مــستـحـيــل',
    'نــاســبــيــًا',
    'ممكن آه وممكن لأ',
    'ده عشم إبليس في الجنة',
    'أكيد طبعًا',
    'مش متأكد، اسأل تاني',
    'أظن كده آه',
    'ده زي ما تقول ساندويتش كبده بالآيس كريم',
    'احتمال لو بقى فيه فيل بيطير',
    'لو حصل كده، تعالي خدني على كتفيك',
    'ماشي، لو عدي التمساح النيل',
    'ده حتى العصفورة بتقول كده',
    'أقسم لك، ده كذب في كذب',
    'آه، بعد 100 سنة ضوئية',
    'لو الدنيا بقت شوكولاتة',
    'ده محتاج معجزة من السماء',
    'آه، لما النخل يطرح ورد',
    'مستحيل، ده زي ما تقول الجمل يعدي من خرم إبرة',
    'احتمال، لما تلاقي ميكي ماوس ماسك هامر',
    'صعبة، بس مش مستحيلة',
    'آه، لما القمر يبقى جبنة رومي',
    'ماعتقدش، ده زي ما تقول السمك يطير',
    'ده محتاج معجزة من ربنا',
    'ممكن، بس على خفيف',
    'آه، لما الشمس تطلع من الغرب',
    'مش فاكر، بس احتمال وارد',
    'لو النمل كبر وبقى فيل',
    'ده زي ما تقول التماسيح بقت نباتية',
    'يمكن، لما التوتة تطرح مانجو',
    'لا، ده زي ما تقول السمك بيلعب كورة',
    'ده زي ما تقول الميه تطلع نار',
    'لأ، ده زي ما تقول الجمل يطير',
    'آه، لما الفيل يرقص باليه',
    'ده ممكن يحصل في الأحلام',
    'آه، لما التمساح يبقى نباتي',
    'لا، ده زي ما تقول الحمار يطير',
    'ده محتاج معجزة',
    'ممكن، لو حصل انقلاب في القوانين الطبيعية',
    'لا أعتقد، ده زي ما تقول الطماطم بقت بطيخ',
    'لو الدنيا بقت فيها عجايب',
    'آه، لما الفيل يبقى قد النملة',
    'مستحيل، ده زي ما تقول القمر بقى جبنة رومي',
    'ده زي ما تقول الطيارة تسبح في البحر',
    'آه، لما الحوت يبقى بيلعب جمباز',
    'لو حصل كده، نروح كلنا نزور الفضاء',
    'ده زي ما تقول الزرافة تعوم في البحر',
    'لا، ده زي ما تقول الحمار يلعب كرة',
    'ده زي ما تقول التمساح يبقى نباتي'
  ]
  
  // Shuffle the responses array
  shuffle(responses)
  
  let x = responses[0] // Pick the first response after shuffling
  let top = `*هــل ${text}*\n\n*الــأجــابـه :* ${x}`.trim()
  conn.sendFile(m.reply(top, null, { mentions: [a] }))
}

handler.help = handler.command = ['هل']
handler.tags = ['fun']
handler.group = true
handler.limit = 0
export default handler

function shuffle(array) {
  for (let i = array.length - 1; i > 0; i--) {
    const j = Math.floor(Math.random() * (i + 1))
    [array[i], array[j]] = [array[j], array[i]]
  }
}